## Data grouping and aggregation

In [1]:
import pandas as pd
import numpy as np

In [2]:
df =  pd.DataFrame({
     'category': ['A', 'B', 'A', 'B', 'A', 'C', 'C', 'B'],
    'value1': [1, 2, 3, 4, 5, 6, 7, 8],
    'value2': [10, 20, 30, 40, 50, 60, 70, 80]}
)

In [3]:
grouped_mean = df.groupby('category').mean()

grouped_mean.head()

            value1     value2
category
A         3.000000  30.000000
B         4.666667  46.666667
C         6.500000  65.000000

In [4]:
grouped_agg = df.groupby('category').agg(
 {
   'value1' : [ 'mean' , 'max'],
   'value2' : [ 'sum' ,  'min']
 }
)


grouped_agg.head()

            value1     value2
              mean max    sum min
category
A         3.000000   5     90  10
B         4.666667   8    140  20
C         6.500000   7    130  60

In [5]:
grouped_first = df.groupby('category').first()#last()


grouped_first.head()

          value1  value2
category
A              1      10
B              2      20
C              6      60

In [6]:
def custom_fuct(group):

 return pd.Series(
  {
   'value1_range' : f' { group["value1"].min() } -  { group["value1"].max() }',
   'value2_mean' : group['value2'].mean()
  }
 )


grouped_with_func = df.groupby('category').apply(custom_fuct)

grouped_with_func.head()

         value1_range  value2_mean
category
A              1 -  5    30.000000
B              2 -  8    46.666667
C              6 -  7    65.000000